avr-rust/avrd/packs/tiny/ATtiny441.atdf
        <register caption="Remap Port Pins" name="REMAP" offset="0x65" size="1">
          <bitfield caption="SPI Pin Mapping" mask="0x02" name="SPIMAP"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_SCK_RATE">
        <value caption="fcl/4" name="VAL_0x00" value="0x00"/>
        <value caption="fcl/16" name="VAL_0x01" value="0x01"/>
        <value caption="fcl/64" name="VAL_0x02" value="0x02"/>
        <value caption="fcl/128" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SOIC_14">
      <pin pad="GND" position="14"/>
      <pin pad="PA0" position="13"/>
      <pin pad="PA1" position="12"/>
      <pin pad="PA2" position="11"/>
      <pin pad="PA3" position="10"/>
      <pin pad="PA4" position="9"/>
      <pin pad="PA5" position="8"/>
      <pin pad="PA6" position="7"/>
      <pin pad="PA7" position="6"/>
      <pin pad="PB2" position="5"/>
      <pin pad="PB3" position="4"/>
      <pin pad="PB1" position="3"/>
      <pin pad="PB0" position="2"/>
      <pin pad="VCC" position="1"/>
    </pinout>
    <pinout name="QFN_20">
      <pin pad="PA4" position="1"/>
      <pin pad="PA3" position="2"/>
      <pin pad="PA2" position="3"/>
      <pin pad="PA1" position="4"/>
      <pin pad="PA0" position="5"/>
      <pin pad="GND" position="8"/>
      <pin pad="VCC" position="9"/>
      <pin pad="PB0" position="11"/>
      <pin pad="PB1" position="12"/>
      <pin pad="PB3" position="13"/>
      <pin pad="PB2" position="14"/>
      <pin pad="PA7" position="15"/>
      <pin pad="PA6" position="16"/>
      <pin pad="PA5" position="20"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
